  ### Deployment Results ✅

  **JamesHaughey** successfully deployed branch `feature/add-layers` to **production**

  <details><summary>Show Results</summary>

  ```terraform
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

# module.dynamodb_table.aws_dynamodb_table.default[0] will be created
+ resource "aws_dynamodb_table" "default" {
    + arn              = (known after apply)
    + billing_mode     = "PAY_PER_REQUEST"
    + hash_key         = "PK"
    + id               = (known after apply)
    + name             = "elbokade"
    + read_capacity    = (known after apply)
    + stream_arn       = (known after apply)
    + stream_enabled   = false
    + stream_label     = (known after apply)
    + stream_view_type = (known after apply)
    + table_class      = "STANDARD"
    + tags             = {
        + "Name"      = "elbokade"
        + "Namespace" = "elbokade"
      }
    + tags_all         = {
        + "Name"      = "elbokade"
        + "Namespace" = "elbokade"
      }
    + write_capacity   = (known after apply)

    + attribute {
        + name = "PK"
        + type = "S"
      }

    + point_in_time_recovery {
        + enabled = true
      }

    + server_side_encryption {
        + enabled     = true
        + kms_key_arn = (known after apply)
      }

    + ttl {
        + attribute_name = "Expires"
        + enabled        = true
      }
  }

Plan: 1 to add, 0 to change, 0 to destroy.
module.dynamodb_table.aws_dynamodb_table.default[0]: Creating...
module.dynamodb_table.aws_dynamodb_table.default[0]: Still creating... [10s elapsed]
module.dynamodb_table.aws_dynamodb_table.default[0]: Still creating... [20s elapsed]
module.dynamodb_table.aws_dynamodb_table.default[0]: Creation complete after 26s [id=elbokade]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

```

  </details>